album_songs = {'Почему': 4.45, 'Снег': 2.35, 'Cиноптик': 3.46, 'Ромашки': 3.27, 'Маечки': 3.13,
     'СПИД': 3.35, 'Румба': 3.10, 'Скандал': 2.49, 'Непошлое': 3.31, 'Припевочка': 2.58,
     '-140': 3.53, 'Ариведерчи': 2.47, 'Ракеты': 2.48, 'Пропущено': 4.01}

time = 0
N = int(input('Сколько песен выбрать? '))
for i in range(N):
    print('Введите', end=' ')
    print(i + 1, end=' ')
    title = input('песни: ')
    for key, value in album_songs.items():
        if title == key:
            time += value
print(time)
